# ACME client
brew "acme.sh"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# AI Coding Agent IDE
cask "antigravity-ide"
# Universal chat app powered by Matrix
cask "beeper"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Voice and text chat software
cask "discord"
# Free and open-source image editor
cask "gimp"
# Utility to hide menu bar items
cask "hiddenbar"
# Tool for downloading and authorising IK Multimedia software
cask "ik-product-manager"
# Game client for itch.io
cask "itch"
# Media system
cask "jellyfin"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source design editor compatible with Figma
cask "openpencil"
# Software installer and device manager for Universal Audio products
cask "ua-connect"
# Open-source code editor
cask "visual-studio-code"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
mas "Logic Pro", id: 634148309
mas "Tailscale", id: 1475387142
vscode "2kabhishek.nerdy-vscode"
vscode "aaron-bond.better-comments"
vscode "arturock.unix-file-stats"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ctc.vscode-tree-extension"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hellbill.simple-dark-red-white-theme-sample"
vscode "hqjs.hq-live-server"
vscode "hudadamar21.elegant-red"
vscode "idleberg.applescript"
vscode "igorsbitnev.error-gutters"
vscode "iliazeus.vscode-ansi"
vscode "ivhernandez.vscode-plist"
vscode "jnoronha.toolsforvscode"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.remote-wsl-recommender"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "nico-castell.linux-desktop-file"
vscode "nodesource.vscode-for-node-js-development-pack"
vscode "oderwat.indent-rainbow"
vscode "paulober.pico-w-go"
vscode "phoenisx.cssvar"
vscode "piousdeer.adwaita-theme"
vscode "pkief.material-icon-theme"
vscode "raspberry-pi.raspberry-pi-pico"
vscode "redhat.vscode-xml"
vscode "rootedbox.iterm-integration"
vscode "samuelcolvin.jinjahtml"
vscode "shyykoserhiy.vscode-spotify"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "twxs.cmake"
vscode "waseemakram.jinja-snippets-flask"
vscode "yarimit.vscode-charcode-ext"
vscode "yzhang.markdown-all-in-one"
vscode "zeshuaro.vscode-python-poetry"
