brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"
brew "nano"
brew "powerlevel10k"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "zoxide"
cask "beeper"
cask "bettertouchtool"
cask "discord"
cask "gimp"
cask "hiddenbar"
